package com.example.sophiaapp.utils.localization

object AppStrings{
    object Profile{
        const val SCREEN_TITLE="Профиль"
        const val SAVE_BUTTON="Сохранить"
        const val EDIT_PROFILE="Редактировать профиль"
        const val CHANGE_PHOTO="Изменить фотографию"
        const val NAME_LABEL="Имя"
        const val NAME_PLACEHOLDER="Введите ваше имя"
        const val ABOUT_DEVELOPERS="О разработчиках"
        const val INFORMATION="Информация"
        const val ADD_PHOTO="Добавить фотографию"
        const val PHOTO_PROFILE="Фотография профиля"
        const val COMPLETE_PROFILE="Заполните свой профиль"
        const val FULL_NAME="Полное имя"
        const val AGE="Возраст"
        const val PHONE_NUMBER="Номер телефона"
        const val PASSWORD="Пароль"
        const val EMAIL="Почта"
    }
    object Library{
        const val SCREEN_TITLE="Библиотека"
        const val PHILOSOPHY_BASICS="Основы философии"
        const val INTERACTIVE_LEARNING="Интерактивное обучение"
        const val EXPERT_INSTRUCTOR="Диалектика"
    }
    object NavigationBar{
        const val HOME="Главная"
        const val LIBRARY="Библиотека"
        const val PROGRESS="Прогресс"
        const val PROFILE="Профиль"
    }
    object CourseCard{
        const val EXPLORE="Исследовать"
    }
    object FilterBottomSheet{
        const val EPISTEMOLOGY="Эпистемология"
        const val ETHICS="Этика"
        const val LOGIC="Логика"
        const val METAPHYSICS="Метафизика"
        const val POLITICAL_PHILOSOPHY="Политическая философия"
        const val PHILOSOPHY_LANGUAGE="Философия языка"
        const val PHILOSOPHY_SCIENCE="Философия науки"
        const val ETHICAL_THEORIES="Этические теории"
        const val PHILOSOPHY_TECHNOLOGY="Философия технологии"
        const val FILTER="Фильтр"
        const val POPULAR_TOPICS="Популярные темы"
        const val  BRANCH="Ветви"
        const val APPLY_FILTERS="Применить фильтр"

    }
    object SearchBar{
        const val SEARCH="Поиск"
        const val SEARCH_PHILOSOPHY_TOPICS="Поиск по темам"

    }
    object HomeScreen{
        const val WELCOME_PHILOSOPHER="С возвращением, философ"
        const val EXPLORE_PHILOSOPHY="Исследуйте философию"
        const val DIVE_INTO_THE_DEPTHS="Погрузитесь в глубины"
        const val UNLOCK_NEW="Открывайте новые возможности ежедневно"
        const val PONDER_THE_MYSTERIES="Размышляйте о тайнах"
        const val PHILOSOPHICAL_TOOLS="Философские инструменты"
        const val JOIN_GLOBAL="Присоединяйтесь к глобальному сообществу мыслителей"
        const val BEGIN_NOW="Начинайте прямо сейчас"
        const val DISCOVER_THOUGHT="Откройте для себя мыслительные категории"
        const val EXPLORE_EXISTENTIAL="Исследуйте экзистенциальное"
        const val PHILOSOPHY_ONLIFE="Философские взгляды на жизнь"
        const val STUDY_PHILOCOPHICAL="Изучайте философское"
        const val EXPLORE="Исследуйте"

    }
    object Progress{
        const val WELCOMEPHILOSOPHER="Добро пожаловать"
        const val SCREEN_TITLE="Прогресс обучения"
        const val YOUR_PROGRESS = "Ваш прогресс"
        const val OVERALL_PROGRESS = "Общий прогресс"
        const val COMPLETED_LECTURES = "Пройденные лекции"
        const val COMPLETED_TOPICS = "Изученные темы"
        const val HOURS_SPENT = "Часов изучено"
        const val ACHIEVEMENTS = "Достижения"
        const val RECENT_ACTIVITY = "Недавняя активность"
        const val KEEP_GOING = "Продолжайте в том же духе!"
        const val PROGRESS_PERCENTAGE = "% пройдено"
        const val TOTAL_TIME = "Общее время"
        const val LEVEL = "Уровень"
    }
    object Welcome{
        const val SCREEN_TITLE="Добро пожаловать"
        const val SUBTITLE="Философия спасёт мир"
        const val CONTINUE_BUTTON="Начать"
    }
    object Auth{
        const val SIGNUP_TITLE="Регистрация"
        const val SIGNIN_TITLE="Вход"
        const val NAME_LABEL="Имя"
        const val AGE_LABEL="Возраст"
        const val EMAIL="Email"
        const val PASSWORD="Пароль"
        const val SIGNUP_BUTTON="Зарегистрироваться"
        const val SIGNIN_BUTTON="Войти"
        const val ALREADY_HAVE_ACCOUNT="Уже есть аккаунт? Войти"
        const val NO_ACCOUNT="Нет аккаунта? Зарегистрироваться "
        const val BIRTHDATE="Дата рождения"
        const val CONFIRMPASSWORD="Повторите пароль"
    }
    object About{
        const val SCREEN_TITLE="О разработчиках"
        const val APP_DESCRIPTION = "Команда разработчиков \"ДиалектикУм\" — студенты факультета информационных систем и технологий УлГТУ, объединившие свои навыки и знания для создания уникального образовательного продукта. \n" +
                "\n" +
                "Наша команда сочетает технические умения в области мобильной разработки с глубоким интересом к философии. Каждый член команды внес свой вклад в различные аспекты проекта: от программирования и дизайна интерфейса до создания образовательного контента и тестирования.\n" +
                "\n" +
                "Мы стремимся не только применять полученные в университете знания на практике, но и создать действительно полезный инструмент, который поможет другим студентам в изучении философии."
        const val APP_DESCRIPTION_PROJECT ="ДиалектикУм — образовательное мобильное приложение, созданное для изучения философии в интерактивном формате. Проект разработан студентами группы ИСТбд-21 факультета информационных систем и технологий Ульяновского государственного технического университета (УлГТУ).\n" +
                "\n" +
                "Приложение предоставляет структурированные материалы по различным философским направлениям, интерактивные тесты и задания, возможность отслеживания прогресса обучения, а также разнообразный медиа-контент для углубленного понимания философских концепций.\n" +
                "\n" +
                "Основная цель ДиалектикУм — сделать изучение философии доступным, интерактивным и увлекательным для студентов и всех интересующихся. Приложение помогает развивать критическое мышление и формировать целостное мировоззрение через знакомство с ключевыми философскими идеями.\n" +
                "\n" +
                "Проект реализован в рамках научно-исследовательской работы студентов (НИРС) под руководством доцента кафедры философии Ташлинской Елены Шамильевны. Разработка осуществлена при поддержке Ульяновского государственного технического университета.\n" +
                "\n" +
                "ДиалектикУм — это не просто учебное пособие, а современный образовательный инструмент, объединяющий классическую философию и инновационные технологии обучения."
        const val DEVELOPER_NAME = "Ваше имя"
        const val DEVELOPER_ROLE = "Разработчик приложения"
        const val DEVELOPER_EMAIL = "your.email@example.com"
        const val APP_VERSION = "Версия"

        const val TEAM_SECTION = "Команда разработчиков"
        const val CONTRIBUTION_SECTION = "Вклад в проект"
        const val ACKNOWLEDGMENTS = "Благодарности"

        const val PROJECT_TITLE = "О проекте"
        const val PROJECT_DESCRIPTION = "Описание проекта"
        const val TECHNICAL_INFO = "Техническая информация"
        const val LEGAL_INFO = "Юридическая информация"
        const val ADDITIONAL_INFO = "Дополнительная информация"
        const val PRIVACY_POLICY = "Политика конфиденциальности"
        const val TERMS_OF_USE = "Условия использования"
        const val REPORT_BUG = "Сообщить об ошибке"
        const val FAQ = "Часто задаваемые вопросы"

        const val DEVELOPER_NAME_ONE = "Саранцев Семён Александрович"
        const val DEVELOPER_GROUP = "Группа: ИСТбд-21"
        const val DEVELOPER_FACULTY = "Факультет информационных систем и технологий"
        const val DEVELOPER_UNIVERSITY = "УлГТУ"

        const val DEVELOPER_EMAIL_ONE = "samreactor@yandex.ru"


        const val GITHUB_URL_ONE = "https://github.com/Semiys"
        const val TELEGRAM_URL_ONE = "https://t.me/k0tlinks_developer"

        const val DEVELOPER_NAME_TWO = "Апахова Ксения Денисовна"
        const val DEVELOPER_GROUP_TWO = "Группа: ИСТбд-21"
        const val DEVELOPER_FACULTY_TWO = "Факультет информационных систем и технологий"
        const val DEVELOPER_UNIVERSITY_TWO = "УлГТУ"

        const val DEVELOPER_EMAIL_TWO = "k.apahova@inbox.ru"
        const val DEVELOPER_ROLE_ONE = "Project Manager, Android Developer, UI/UX Designer, Content Manager"
        const val DEVELOPER_ROLE_TWO = "Project Manager, Android Developer, UI/UX Designer, Content Manager"

        const val GITHUB_URL_TWO = "https://github.com/ksushka2"
        const val TELEGRAM_URL_TWO= "https://t.me/k0tlinks_developer"

        const val DEVELOPER_AVATAR = "Аватар разработчика"
        const val GITHUB_PROFILE = "GitHub профиль"
        const val TELEGRAM_CONTACT = "Telegram контакт"
    }


    object Common {
        const val BACK = "Назад"

    }
    object Project {
        const val ABOUT_APP = "О приложении"
        const val TECHNICAL_INFO = "Техническая информация"
        const val LEGAL_INFO = "Правовая информация"
        const val CONTACTS = "Контакты"
        const val PRIVACY_POLICY = "Политика конфиденциальности"
        const val TERMS_OF_USE = "Условия использования"
        const val VERSION = "Версия"
        const val PLATFORM = "Платформа"
        const val MIN_ANDROID = "Мин. версия Android"
        const val EMAIL = "Email"
        const val WEBSITE = "Сайт Университета"
        const val WEBSITEUL="https://ulstu.ru"
        const val EMAILMY="samreactor@yandex.ru"
        const val REPGITHUB="https://github.com/Semiys/Sophiaapp"
        const val REPPROJECT="Репозиторий проекта"
        const val ULSTUSOPHIA="https://ulstu.ru/teachers/tashlinskaya-elena-shamilevna/"
        const val ULSTUTEACHER="Преподаватель"
    }
    object Legal {
        const val PRIVACY_POLICY_TEXT = """
        1. Общие положения
    Настоящая Политика конфиденциальности определяет порядок обработки и защиты информации о физических лицах, используемой приложением "ДиалектикУм". Политика разработана в соответствии с Федеральным законом РФ "О персональных данных" №152-ФЗ.

    2. Сбор информации
    Мы собираем только ту информацию, которая необходима для функционирования приложения: имя пользователя, адрес электронной почты, данные о прогрессе обучения.

    3. Использование информации
    Мы используем полученную информацию для:
    - Предоставления персонализированного обучающего контента
    - Отслеживания прогресса обучения
    - Улучшения качества приложения

    4. Передача данных третьим лицам
    Мы не передаем ваши персональные данные третьим лицам без вашего явного согласия, за исключением случаев, предусмотренных законодательством РФ.

    5. Использование cookies и аналогичных технологий
    Наше приложение может использовать технологии cookies и локального хранилища для улучшения функциональности и сохранения ваших настроек. Вы можете отключить эти технологии в настройках вашего устройства.

    6. Защита информации
    Мы принимаем необходимые технические и организационные меры для защиты персональных данных от несанкционированного доступа, уничтожения, изменения или распространения.

    7. Права пользователей
    Вы имеете право запросить доступ к своим персональным данным, требовать их исправления или удаления. Для реализации этих прав обратитесь по контактному адресу, указанному ниже.

    8. Срок хранения данных
    Данные хранятся в течение всего срока использования приложения и могут быть удалены по запросу пользователя.

    9. Изменения в политике конфиденциальности
    Мы оставляем за собой право вносить изменения в настоящую Политику конфиденциальности с уведомлением пользователей.
    """

        const val TERMS_OF_USE_TEXT = """
        1. Принятие условий
    Используя приложение "ДиалектикУм", вы соглашаетесь с настоящими Условиями использования. Если вы не согласны с каким-либо из пунктов, вам следует прекратить использование приложения.

    2. Возрастные ограничения
    Приложение предназначено для пользователей всех возрастов, однако пользователи младше 14 лет должны получить согласие родителей или законных представителей перед использованием приложения.

    3. Регистрация и аккаунт
    Для использования некоторых функций приложения может потребоваться регистрация. Вы обязуетесь предоставлять достоверную информацию при создании аккаунта. Вы несете ответственность за сохранность своего пароля и безопасность своей учетной записи.

    4. Использование контента
    Весь контент приложения предназначен исключительно для образовательных целей. Запрещается копирование, распространение или модификация контента без разрешения.

    5. Уведомления и коммуникация
    Приложение может отправлять вам уведомления, связанные с вашим прогрессом обучения, обновлениями или изменениями в работе приложения. Вы можете управлять настройками уведомлений в приложении.

    6. Ограничение ответственности
    Мы не несем ответственности за любые прямые или косвенные убытки, возникшие в результате использования или невозможности использования приложения. Мы предоставляем приложение "как есть", без каких-либо гарантий.

    7. Отказ от использования
    Мы оставляем за собой право заблокировать доступ к приложению пользователям, нарушающим настоящие условия использования или законодательство РФ.

    8. Интеллектуальная собственность
    Все права на приложение и его контент принадлежат разработчикам "ДиалектикУм". Любое несанкционированное использование интеллектуальной собственности запрещено.

    9. Изменение условий
    Мы оставляем за собой право изменять настоящие Условия использования в любое время. Продолжая использовать приложение после внесения изменений, вы принимаете обновленные условия.

    10. Применимое право
    Настоящие Условия использования регулируются и толкуются в соответствии с законодательством Российской Федерации.

    11. Расторжение соглашения
    Вы можете прекратить использование приложения в любое время. Мы также можем приостановить предоставление услуг при нарушении настоящих условий.
    """
    }
    object Course {
        const val THEORY = "Теория"
        const val PRACTICE = "Практика"
        const val CONTINUE_TO_PRACTICE = "Перейти к практике"
        const val BACK_TO_COURSE = "Вернуться к курсу"

        const val COURSE_1_TITLE = "Введение"
        const val COURSE_2_TITLE = "Этапы развития диалектики"
        const val COURSE_3_TITLE = "Основные принципы"
        const val COURSE_4_TITLE="Законы диалектики"
        const val COURSE_5_TITLE="Закон единства и борьбы противоположностей"
        const val COURSE_6_TITLE="Закон перехода количественных изменений в качественные"
        const val COURSE_7_TITLE="Закон отрицания отрицания"
        const val COURSE_8_TITLE="Категории диалектики"

        const val DEFAULT_COURSE_TITLE = "Философия"

        const val COURSE_1_DESCRIPTION = "Диалектика - исходный принцип развития всего существующего и универсальный метод познания природы, общества и человеческого мышления. При этом диалектика как логика познания раскрывает значение самых законов мышления в их развитии и связи с развитием наиболее общих законов объективного мира.\n" +
                "Основные признаки:\n" +
                "1.\tВ движении выявляется внутренний источник (причина), поэтому движение трактуется как самодвижение, объект как движущийся.\n" +
                "2.\tИсточник движения – это противоречие, т. е. специфический тип связи, моментов (сторон, характеристик) объекта.\n" +
                "3.\tВзаимодействие внутри объекта приводит к одновременным изменениям всех его параметров, что означает преобразование объекта в другой объект.\n" +
                "4.\tПреобразованный в ходе движения объект заключает в себе моменты (черты, тенденции) своего предшественника и принципиально иные, не существовавшие ранее.\n" +
                "Все формы бытия подвержены изменениям, развитию. Развитие – необратимое, закономерное и определенным образом направленное изменение материальных и идеальных объектов мира, приводящее к возникновению нового качества. Развитие – высшая форма движения. В свою очередь движение – основа развития. Движение также является внутренним свойством материи и уникальным явлением окружающей действительности, поскольку движение характеризуется целостностью, непрерывностью, и наличием противоречий. Движение также является способом связи в материальном мире.\n" +
                "Структура диалектики – совокупность устойчивых связей и отношений между составляющими ее элементами. \n" +
                "К структурным элементам диалектики относятся:\n" +
                "1.\tпринципы диалектики; \n" +
                "2.\tзаконы диалектики; \n" +
                "3.\tкатегории диалектики.\n"
        const val COURSE_2_DESCRIPTION = "В истории философии выделяют несколько основных этапов развития диалектики: \n" +
                "•\tантичный\n" +
                "•\tсредневековый\n" +
                "•\tнововременной \n" +
                "•\tсовременный. \n" +
                "В античности диалектика фокусировалась на всеобщей изменчивости и взаимосвязи явлений, развивая понятийный аппарат через эристику. Особый вклад внесли древнегреческие философы - Гераклит, развивавший идею вечного становления, и Сократ, использовавший диалектический метод в беседах. \n" +
                "В Средневековье диалектика приобрела религиозный характер, исследуя противоположности через призму божественного абсолюта. Фома Аквинский применял диалектику для обоснования религиозных догматов.\n" +
                "Новое время, особенно немецкая классическая философия, создало систематическое учение о развитии мысли. Гегель разработал трехступенчатую модель познания: от чувственного восприятия через рассудок к разуму. Он показал, что истинное знание возможно только как система взаимосвязанных категорий. Его диалектический метод включал триаду: тезис-антитезис-синтез. \n" +
                "Тезис — это начальное состояние или идея, утверждение или точка зрения.  \n" +
                "Антитезис — это противоположность или вызов тезису, ответ или противоречие первоначальной идее.  \n" +
                "Синтез — это решение или баланс между тезисом и антитезисом. Синтез объединяет элементы обоих, трансформируя их в новое, более развитое понимание или состояние. \n" +
                " \n" +
                "Диалектическая логика, в отличие от формальной, демонстрирует, как противоположности переходят друг в друга при нарушении меры, раскрывая их глубинное тождество. В современной философии диалектика развивается в различных направлениях - от материалистической диалектики до негативной диалектики Франкфуртской школы.\n"
        const val COURSE_3_DESCRIPTION = "Принципы диалектики – это фундаментальные теоретические положения, отражающие наиболее существенные характеристики реальной действительности и 2 являющиеся методом ее познания.\n" +
                "Основными принципами диалектики являются: \n" +
                "•\tпринцип всеобщей связи; \n" +
                "•\tпринцип системности; \n" +
                "•\tпринцип детерминизма (причинности); \n" +
                "•\tпринцип историзма.\n" +
                "Всеобщая связь означает целостность окружающего мира, его внутреннее единство, взаимосвязь, взаимозависимость всех его компонентов. \n" +
                "Системность требует разграничения внутренней и внешней сторон исследуемого объекта, сущности и ее проявлений, обнаружения единства многообразия сторон, раскрытия формы и содержания, случайного и необходимого в каждом объекте. Кроме этого системность означает, что многочисленные связи в мире существуют не хаотично, а упорядочено. Они образуют целостную систему. Благодаря этому окружающий мир имеет внутреннюю целесообразность. \n" +
                "Принцип детерминизма заключается в нахождении таких связей и отношений, которые обуславливают возникновение и развитие данного объекта. Причина порождает следствия, а связи в целом называются причинно-следственными связями. \n" +
                "Принцип историзма требует исторического подхода к изучению явлений действительности, а также подразумевает вечность истории мира, его существование и развитие которое продолжается всегда. Принципы диалектики отражают те процессы, связи и отношения, которые существуют в мире.\n"

        const val COURSE_4_DESCRIPTION="Среди способов понимания диалектики развития основополагающими являются законы диалектики. \n" +
                "Закон – это объективные (не зависящие от человека), общие, стабильные, необходимые, повторяющиеся связи между сущностями и внутри сущностей. Рассмотрим для примера закон Архимеда. Он выражает связь между явлениями (между твердым телом, погруженным в жидкость и самой жидкостью). Эта связь 3 объективна, т.е. независима от человека. Закон Архимеда выражает также не частную связь отдельного тела с отдельной жидкостью, а связь общую: погружение любого тела в любую жидкость дает результат, вытекающий из закона. Связь эта существенная и необходимая, так как раскрывает важные отношения между телами и жидкостью и обнаруживается всякий раз, когда они взаимодействуют. Наконец, сколько бы раз мы не повторяли эксперимент, всякий раз закон будет подтверждаться. Это значит, что он выражает связь устойчивую, повторяющуюся. \n" +
                "Классифицировать законы можно: \n" +
                "•\tпо сфере применимости (всеобщие, общенаучные, частнонаучные); \n" +
                "•\tпо внутреннему содержанию (законы строения, законы функционирования, законы развития);\n" +
                "•\tпо форме проявления (динамические, статистические). В понятие закона входит как составная часть понятие закономерности. \n"


        const val COURSE_5_DESCRIPTION="Начнем с источника развития. Каждое сложное явление в природе, обществе, мышлении нужно рассматривать как систему. Для того, чтобы такая система могла существовать и развиваться, между ее частями должно быть взаимодействие. Например, суммарный заряд атомного ядра должен быть сбалансирован с суммарным зарядом электронов; также необходимо определенное соответствие процессов ассимиляции и диссимиляции в организме; общество становится устойчивым, если его производительные силы соответствуют производственным отношениям. Отсюда, как - будто, напрашивается вывод: чем больше соответствия внутри системы, тем она лучше и быстрее развивается. Однако все обстоит гораздо сложнее. В действительности ни в одном реальном объекте, явлении не бывает полного соответствия элементов. Более того, обязательно определенное несоответствие, и это является условием развития каждого явления или процесса. Электроны и ядро атома различаются знаком электрического заряда, процесс ассимиляции выполняет совсем другую функцию, чем процесс диссимиляции, производительные силы развиваются быстрее производственных отношений. Если несоответствие значительно, то элементы или процессы называются противоположными. А отношение между противоположностями называется противоречием. Почему противоречием? Потому что, противоположности неразрывны, но в то же время они противоположности. Отношение, которое характеризуется единством противоположностей и их борьбой называется противоречием. А философский закон единства и борьбы противоположностей утверждает, что источником развития в 4 природе и обществе являются внутренние противоречия. Он отвечает на вопрос в чем источник развития. Однако, необходимо отметить то, что современная физика имеет дело с большим многообразием частиц во взаимодействии некоторых из них противоречия не обнаружены. Частицы взаимодействуют между собой, только и всего. Кроме того, существуют частицы нейтрального электрозаряда. Поэтому, видимо, нельзя свести все к одному универсальному закону."

        const val COURSE_6_DESCRIPTION="Любой предмет обладает качеством , отличающим его от других предметов и определенным количеством, характеризующим его со стороны величины, объема, веса, температуры перехода из одного агрегатного состояния в другое. Возьмем обыкновенную алюминиевую пластинку. Вес, объем, атомная масса, заряд ядра, температура плавления, – это количественная характеристика. Наряду с этим, алюминий – металл серебристо-белого цвета, ковкий, хороший проводник тепла и тока, легко окисляется. Это качественная характеристика. Подобным образом можно дать количественную характеристику и установить качественную специфику любого элемента, вещества, предмета. Таким образом, качество – это объективная, целостная и относительно устойчивая совокупность признаков предмета. Количество – это величина и степень интенсивности развития предметов и явлений. Количество и качество связаны между собой. Количественные изменения приводят к качественным, хотя до определенного момента этого не происходит. Например, нагревая лед на несколько градусов, мы не наблюдаем изменения агрегатного состояния вещества, но, если довести температуру до точки плавления льда, он превратится в воду, нагревая воду до ста градусов, мы увидим ее превращение в пар. Количественные изменения переходят в качественные. В живой природе переход количественных изменений в качественные можно проследить, наблюдая за развитием бабочки. В нем выделяется рад качественно различных стадий (гусеница, куколка, бабочка). Переход от одной стадии к другой зависит от определенных количественных процессов в организме насекомого. Наконец, связано количество и качество и в развитии мышления, сознания. Новорожденный ребенок не может мыслить и выражать мысль членораздельно. На протяжении первого года жизни идет постепенное количественное накопление соответствующих навыков. Первый качественный скачок – речь, затем – логические рассуждения и т.д. Интересно, что и качественные изменения влияют на количественные. В первом примере количественные изменения приводят к превращению льда в воду, т.е. к новому качеству. В свою очередь, вода обладает уже новыми количественными характеристиками (вес, строение, температура изменения агрегатного состояния). В примере, посвященном развитию сознания качественные изменения, также 5 оказывают влияние на количественные. Чем больше развивается ребенок, тем больше информации он может впитать, тем больше навыков приобрести. Вывод: философский закон перехода количественных изменений в качественные характеризует процесс обновления материального мира в форме скачка. Он отвечает на вопрос как происходит развитие."

        const val COURSE_7_DESCRIPTION="Рассмотрим третий закон диалектики. Возьмем на окружности точку и начнем движение от нее по часовой стрелке. Через некоторое время мы вернемся в исходную точку. Если мы будем повторять круговое движение, то все точки окружности будут пройдены неоднократно. Если мы выберем точку на прямой линии и начнем двигаться от нее, то уже никогда в нее не вернемся. Связь со старым будет полностью утеряна. Оба примера – это примеры метафизического понимания развития. Если возьмем первый пример, то значит не существует никакого прогресса. Если второй, то полностью отбрасывается все предыдущее. Но данные науки позволяют заключить, что в развитии есть прогресс. Это видно на примере живой природы, которая прошла длительный путь развития от простейших до высших форм. Каждый этап в этом развитии как бы отрицал предыдущий, а затем сам отрицался последующим. Происходило своеобразное отрицание отрицания. Но отрицание не означает полного уничтожения предыдущего этапа. В процессе прогрессивного развития новое, возникая из старого впитывает в себя все то положительное, что было в нем. В живой природе каждый новый вид воспроизводит полезные признаки, накопленные предками в процессе эволюционного развития. В истории общества каждый новый социальный строй возникает на основе усвоения материальных и духовных богатств, созданных в предшествующие эпохи. Таким образом, отрицание предполагает связь, преемственность в развитии. Философский закон отрицания отрицания раскрывает прогрессивный характер развития как восхождения от низшего к высшему, от простого к сложному. Лучше всего диалектическую концепцию развития иллюстрировать движением по вертикальной спирали. Выберем на одном из витков исходную позицию и заставим точку A двигаться по спирали. Переходя с витка на виток, точка A будет удаляться от исходной позиции как бы по прямой и никогда не вернется назад. С другой стороны, на каждом витке она будет проходить позицию, которая является проекцией исходного положения, как бы повторяя его, но на более высоком уровне. Данный закон отвечает на вопрос, в каком направлении происходит развитие. "

        const val COURSE_8_DESCRIPTION="Диалектика изучает универсальные, структурные связи и связи детерминации. Выражает эти связи диалектика с помощью определенных научных понятий, или категорий. \n" +
                "Универсальные связи – это связи, пронизывающие все бытие. Выражают эти\n" +
                "связи такие парные категории как единичное и общее, явление и сущность. \n" +
                "\n" +
                "Единичное характеризует отдельный предмет, явление, процесс, отличающийся по своим различным свойствам от других предметов, процессов, в том числе и подобных ему. Невозможно найти двух абсолютно одинаковых предметов. Даже листья с одного дерева отличаются друг от друга. Любые предметы, которые кажутся абсолютно одинаковыми, отличаются друг от друга молекулярным и атомным движением. В то же время, нет предметов и явлений, которые бы не обладали общими чертами с другими предметами и явлениями. Листья березы имеют общие признаки, позволяющие отличить их от листьев дуба или ясеня. Совсем разные деревья от карликовых берез до баобабов несут в себе общие черты, позволяющие объединить их одним понятием «дерево». Наконец, люди, такие разные, но есть нечто общее, позволяющие отличить человека от животного.\n" +
                "Общее – это сходство, однотипность предметов и явлений в некоторых отношениях. Связь единичного и общего носит всеохватывающий характер, в нее включены все явления, предметы, процессы. Эти категории диалектики позволяют сравнивать предметы, выявлять их сходство и различие. Связь этих категорий неразрывна. Причем, общее существует только через единичное, а единичное обязательно заключает в себе те или иные общие черты.\n" +
                "\n" +
                "Явление – это совокупность внешних признаков объекта, который мы наблюдаем. Изучая предмет, мы постигаем его смысл, его назначение или, другими словами, его сущность. \n" +
                "Сущность – это внутренняя сторона объекта, определяющая его природу. Явление и сущность – диалектически связанные противоположности. Они не совпадают друг с другом. Яркий пример – мираж. Человек видит в пустыне оазис, а на самом деле его нет. Сущность этого явления – искривление лучей света атмосферой. Или болезнь. Проявляется она через определенные симптомы, но лечат не неприятные ощущения, а то, что их вызывает Маркс писал: «… Если бы форма проявления и сущность вещей непосредственно совпадали, то всякая наука была бы излишня». Вместе с тем, если бы явление и сущность не были связаны между собой, то познание мира было бы невозможно. Сущность, так или иначе обнаруживает себя в явлениях, а явление есть проявление сущности. Радуга – это явление, видимая разноцветная дуга. А в чем суть этого явления? Радуга – результат преломления света в каплях воды. Сущность обнаружила себя в явлении, явление есть проявление сущности. Познание движется от явлений к сущности, все время углубляясь, поэтому нельзя говорить, что сущность познана. Наука развивается, и то что считается сущностью предмета сегодня, завтра будет явлением по отношению к более глубокой сущности. Студентам предлагается прокомментировать положение Канта, используя категории «сущность» и «явление». «Я признаю, вне нас существуют тела, т.е. вещи, хотя сами по себе совершенно нам неизвестные, но о которых мы знаем по представлениям, возбуждающим в нас их влиянием на нашу чувствительность, а получающим от нас названия тел». \n" +
                "Важное место в философии издавна занимали вопросы устройства мироздания. Из чего все состоит, во что превращается. Сейчас мы поговорим о структурных связях. Именно эти связи помогают ответить на вопрос о строении мироздания. Будем оперировать такими парными категориями как часть и целое, форма и содержание. Много веков назад сложилось убеждение, что понять объект – значит узнать, из чего он состоит. Философскими понятиями, с помощью которых осмысливалось устройство бытия, служили понятия части и целого. Под частями понимали то, что в совокупности образовывает новый предмет. Целое рассматривалось, как сочетание частей. Целое считалось простой суммой частей. Но это упрощенный подход. Набор частей одежды, корабля, здания, еще не платье, не корабль, не здание. Постепенно складывалось убеждение, что целое несводимо только к набору частей и свойства целого несводимы к свойствам частей, из которых это целое состоит. Диалектика сформулировала принцип целостности, в основе которого лежит не просто сумма частей, а их связь, их взаимовлияние. Как понимать аристотелевское положение «целое – больше суммы его частей»? Приведите примеры, подтверждающие этот вывод. \n" +
                "\n" +
                "Важными категориями, которые помогают понять порядок устройства мира, являются также форма и содержание. Любой предмет состоит из определенных элементов, в нем протекают какие-то процессы. Эти элементы и процессы составляют содержание предмета или явления. \n" +
                "Содержание – это совокупность различных элементов и их взаимодействий, определяющих характер того или иного предмета, явления, процесса. \n" +
                "Форма – это способ существования того или иного содержания. Содержание и форма неразрывно связаны. Остроумно и кратко высказался по этому поводу Гегель: «Содержание оформлено, а форма содержательна». В процессе развития содержание играет ведущую роль. Его изменения приводят к изменению формы. Так, в процессе эволюции биологических видов сначала под влиянием внешних условий менялись функции тех или иных органов, а затем и их морфология, форма. \n" +
                "\n" +
                "Детерминизм – это концепция мира, которая основывается на принципах причинности и закономерности. Согласно принципу детерминизма, все явления, процессы и предметы возникают, развиваются и уничтожаются закономерно, в результате определенных причин. Признание причинности и закономерности явлений лежит в основе научного познания. Для понимания связей детерминизма воспользуемся такими категориями как причина и следствие, случайность и необходимость, возможность и действительность. Категории причина и следствие дают знать о себе во всех областях действительности. Понимание их смысла необходимо для занятия любой наукой. Когда одно явление вызывает к жизни другое, то первое называется причиной, а второе следствием. Так, нагревание или охлаждение вещества служит причиной изменения его агрегатного состояния. В реальной жизни связь причин и следствий конечно не так проста. Одна и та же причина может вызывать разные следствия, а одно и то же следствие может быть результатом разные причин. В 1945 году над Хиросимой была взорвана атомная бомба. Следствием этого были разрушения, гибель людей, возникла серьезная экологическая проблема, стала развиваться лейкемия. Первая русская революция стала следствием того, что обострились противоречия между трудом и капиталом, помещиками и крестьянами, следствием наличия национального гнета, наличия самодержавия. Широко распространен тип причинно-следственных связей, вызывающих «эффект домино», когда воздействие одной причины, вызывает целую цепочку следствий, подобно тому, как падение одной кости домино в длинном ряду вызывает падение всех остальных костей. В этом случае каждое новое следствие становится причиной следующего нового следствия. Существует такой тип связи, как взаимодействие. В этом случае причина испытывает обратное воздействие со стороны собственного следствия. Говоря о причинно-следственных связях, выделяют еще условия и повод.\n" +
                "Условия – это то, что помогает развитию причинно-следственных связей. Поводы – это явления, которые сами по себе не вызывают следствия, но дают толчок к нему. В комплексе причина, условие, повод составляют так называемое причинное основание, при наличии которого наступает следствие. \n" +
                "\n" +
                "Необходимой называют такую связь, при которой наступление причины обязательно влечет за собой следствие. \n" +
                "Случайное же может быть, а может не быть. Оно несущественно для того или иного процесса, однако необходимость и случайность тесно взаимосвязаны. Случайность выступает как форма проявления дополнения необходимости. Это видно на примере многих научных открытий. Радиоактивность урана была открыта французским ученым Беккерелем случайно: урановая соль оказалась в одном шкафу с фотопленкой. Однако ясно, что не будь этой случайности, радиоактивность все равно была бы обнаружена, так как открытие было подготовлено развитием науки и стало необходимостью. В конкретном анализе причинных отношений необходимость и случайность тесно связаны с категориями возможность и действительность, с превращением возможности в действительность. \n" +
                "\n" +
                "Возможность – это предпосылка возникновения того или иного явления, процесса. \n" +
                "Действительность – это реальное существование предметов и явлений и развитие их по объективным законам. Эти категории отражают возникновение и развитие предметов и явлений. Возможностей, как правило, возникает несколько. Реализуется одна из них. Какая, зависит от условий. Процесс развития протекает таким образом, что возможность становится действительностью, а эта действительность порождает новые возможности. Процесс этот бесконечен.\n"
        const val DEFAULT_COURSE_DESCRIPTION = "Описание темы будет доступно позже."

        const val THEORY_SUFFIX = ": Теория"
        const val PRACTICE_SUFFIX = ": Практика"
        const val PRACTICE_PLACEHOLDER = "Здесь будет размещена интерактивная игра или задание по теме \""
    }
    object Quiz {
        const val PREVIOUS_BUTTON = "Предыдущий"
        const val NEXT_BUTTON = "Следующий"
        const val FINISH_QUIZ = "Завершить тест"
        // Заменяем на простую строку без форматирования
        const val RESULTS = "Результат: %s из %s"
        // или если хотите отказаться от форматирования вообще:
        // const val RESULTS_PREFIX = "Результат: "
        // const val RESULTS_SUFFIX = " из "
        const val RETURN_TO_COURSE = "Вернуться к курсу"
    }


}